cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Retcs, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x5e);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x3e);

  MCInst Retlo;
  Retlo.setOpcode(AVR32::RETLOr);
  Retlo.addOperand(MCOperand::createReg(AVR32::LR));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Retlo, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x5e);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x3e);

  MCInst Retge;
  Retge.setOpcode(AVR32::RETGEr);
  Retge.addOperand(MCOperand::createReg(AVR32::LR));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Retge, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x5e);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x4e);

  MCInst Reths;
  Reths.setOpcode(AVR32::RETHSr);
  Reths.addOperand(MCOperand::createReg(AVR32::LR));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Reths, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x5e);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x2e);

  MCInst Reteq;
  Reteq.setOpcode(AVR32::RETEQr);
  Reteq.addOperand(MCOperand::createReg(AVR32::LR));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Reteq, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x5e);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x0e);

  MCInst Retne;
  Retne.setOpcode(AVR32::RETNEr);
  Retne.addOperand(MCOperand::createReg(AVR32::LR));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Retne, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x5e);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x1e);

  MCInst Retj;
  Retj.setOpcode(AVR32::RETJ);

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Retj, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xd6);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x33);

  MCInst Rets;
  Rets.setOpcode(AVR32::RETS);

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Rets, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xd6);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x13);

  MCInst Retss;
  Retss.setOpcode(AVR32::RETSS);

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Retss, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xd7);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x63);

  MCInst Rol;
  Rol.setOpcode(AVR32::ROLr);
  Rol.addOperand(MCOperand::createReg(AVR32::R1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Rol, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x5c);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xf1);

  MCInst Ror;
  Ror.setOpcode(AVR32::RORr);
  Ror.addOperand(MCOperand::createReg(AVR32::R1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Ror, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x5d);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x01);

  MCInst Rsub;
  Rsub.setOpcode(AVR32::RSUBrr);
  Rsub.addOperand(MCOperand::createReg(AVR32::R1));
  Rsub.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Rsub, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x04);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x21);

  MCInst Sbc;
  Sbc.setOpcode(AVR32::SBCrrr);
  Sbc.addOperand(MCOperand::createReg(AVR32::R1));
  Sbc.addOperand(MCOperand::createReg(AVR32::R2));
  Sbc.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Sbc, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x01);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x41);

  MCInst Scall;
  Scall.setOpcode(AVR32::SCALL);

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Scall, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xd7);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x33);

  MCInst Scr;
  Scr.setOpcode(AVR32::SCRr);
  Scr.addOperand(MCOperand::createReg(AVR32::R1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Scr, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x5c);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x11);

  MCInst Sleep;
  Sleep.setOpcode(AVR32::SLEEPi);
  Sleep.addOperand(MCOperand::createImm(1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Sleep, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x60);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x00);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x01);

  MCInst Ssrf;
  Ssrf.setOpcode(AVR32::SSRFi);
  Ssrf.addOperand(MCOperand::createImm(1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Ssrf, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xd2);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x13);

  MCInst Sub;
  Sub.setOpcode(AVR32::SUBrr);
  Sub.addOperand(MCOperand::createReg(AVR32::R1));
  Sub.addOperand(MCOperand::createReg(AVR32::R2));

