cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Printed.clear();
  raw_string_ostream BreakpointOS(Printed);
  InstPrinter->printInst(&Breakpoint, /*Address=*/0, /*Annot=*/"", *STI,
                         BreakpointOS);
  BreakpointOS.flush();
  EXPECT_EQ(Printed, "\tbreakpoint");

  Printed.clear();
  raw_string_ostream CastsBOS(Printed);
  InstPrinter->printInst(&CastsB, /*Address=*/0, /*Annot=*/"", *STI, CastsBOS);
  CastsBOS.flush();
  EXPECT_EQ(Printed, "\tcasts.b\tr1");

  Printed.clear();
  raw_string_ostream CastsHOS(Printed);
  InstPrinter->printInst(&CastsH, /*Address=*/0, /*Annot=*/"", *STI, CastsHOS);
  CastsHOS.flush();
  EXPECT_EQ(Printed, "\tcasts.h\tr1");

  Printed.clear();
  raw_string_ostream CastuBOS(Printed);
  InstPrinter->printInst(&CastuB, /*Address=*/0, /*Annot=*/"", *STI, CastuBOS);
  CastuBOS.flush();
  EXPECT_EQ(Printed, "\tcastu.b\tr1");

  Printed.clear();
  raw_string_ostream CastuHOS(Printed);
  InstPrinter->printInst(&CastuH, /*Address=*/0, /*Annot=*/"", *STI, CastuHOS);
  CastuHOS.flush();
  EXPECT_EQ(Printed, "\tcastu.h\tr1");

  Printed.clear();
  raw_string_ostream ComOS(Printed);
  InstPrinter->printInst(&Com, /*Address=*/0, /*Annot=*/"", *STI, ComOS);
  ComOS.flush();
  EXPECT_EQ(Printed, "\tcom\tr1");

  Printed.clear();
  raw_string_ostream CpcOS(Printed);
  InstPrinter->printInst(&Cpc, /*Address=*/0, /*Annot=*/"", *STI, CpcOS);
  CpcOS.flush();
  EXPECT_EQ(Printed, "\tcpc\tr1");

  Printed.clear();
  raw_string_ostream CpcRROS(Printed);
  InstPrinter->printInst(&CpcRR, /*Address=*/0, /*Annot=*/"", *STI,
                         CpcRROS);
  CpcRROS.flush();
  EXPECT_EQ(Printed, "\tcpc\tr1, r2");

  Printed.clear();
  raw_string_ostream CpWOS(Printed);
  InstPrinter->printInst(&CpW, /*Address=*/0, /*Annot=*/"", *STI, CpWOS);
  CpWOS.flush();
  EXPECT_EQ(Printed, "\tcp.w\tr1, r2");

  Printed.clear();
  raw_string_ostream CpWImmOS(Printed);
  InstPrinter->printInst(&CpWImm, /*Address=*/0, /*Annot=*/"", *STI,
                         CpWImmOS);
  CpWImmOS.flush();
  EXPECT_EQ(Printed, "\tcp.w\tr1, -1");

  Printed.clear();
  raw_string_ostream CpWImm21OS(Printed);
  InstPrinter->printInst(&CpWImm21, /*Address=*/0, /*Annot=*/"", *STI,
                         CpWImm21OS);
  CpWImm21OS.flush();
  EXPECT_EQ(Printed, "\tcp.w\tr1, 32");

  Printed.clear();
  raw_string_ostream CsrfOS(Printed);
  InstPrinter->printInst(&Csrf, /*Address=*/0, /*Annot=*/"", *STI, CsrfOS);
  CsrfOS.flush();
  EXPECT_EQ(Printed, "\tcsrf\t1");

  Printed.clear();
  raw_string_ostream NegOS(Printed);
  InstPrinter->printInst(&Neg, /*Address=*/0, /*Annot=*/"", *STI, NegOS);
  NegOS.flush();
  EXPECT_EQ(Printed, "\tneg\tr1");

  Printed.clear();
  raw_string_ostream EorOS(Printed);
  InstPrinter->printInst(&Eor, /*Address=*/0, /*Annot=*/"", *STI, EorOS);
  EorOS.flush();
  EXPECT_EQ(Printed, "\teor\tr1, r2");

  Printed.clear();
  raw_string_ostream FrsOS(Printed);
  InstPrinter->printInst(&Frs, /*Address=*/0, /*Annot=*/"", *STI, FrsOS);
  FrsOS.flush();
  EXPECT_EQ(Printed, "\tfrs");

  Printed.clear();
  raw_string_ostream IcallOS(Printed);
  InstPrinter->printInst(&Icall, /*Address=*/0, /*Annot=*/"", *STI, IcallOS);
  IcallOS.flush();
  EXPECT_EQ(Printed, "\ticall\tr1");

  Printed.clear();
  raw_string_ostream LslOS(Printed);
  InstPrinter->printInst(&Lsl, /*Address=*/0, /*Annot=*/"", *STI, LslOS);
  LslOS.flush();
  EXPECT_EQ(Printed, "\tlsl\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream LsrOS(Printed);
  InstPrinter->printInst(&Lsr, /*Address=*/0, /*Annot=*/"", *STI, LsrOS);
  LsrOS.flush();
  EXPECT_EQ(Printed, "\tlsr\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream MaxOS(Printed);
  InstPrinter->printInst(&Max, /*Address=*/0, /*Annot=*/"", *STI, MaxOS);
  MaxOS.flush();
  EXPECT_EQ(Printed, "\tmax\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream MinOS(Printed);
  InstPrinter->printInst(&Min, /*Address=*/0, /*Annot=*/"", *STI, MinOS);
  MinOS.flush();
  EXPECT_EQ(Printed, "\tmin\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream MulCompactOS(Printed);
  InstPrinter->printInst(&MulCompact, /*Address=*/0, /*Annot=*/"", *STI,
                         MulCompactOS);
  MulCompactOS.flush();
  EXPECT_EQ(Printed, "\tmul\tr1, r2");

  Printed.clear();
  raw_string_ostream MulImmOS(Printed);
  InstPrinter->printInst(&MulImm, /*Address=*/0, /*Annot=*/"", *STI,
                         MulImmOS);
  MulImmOS.flush();
  EXPECT_EQ(Printed, "\tmul\tr1, r2, -1");

  Printed.clear();
  raw_string_ostream MulOS(Printed);
  InstPrinter->printInst(&Mul, /*Address=*/0, /*Annot=*/"", *STI, MulOS);
  MulOS.flush();
  EXPECT_EQ(Printed, "\tmul\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream MulsDOS(Printed);
  InstPrinter->printInst(&MulsD, /*Address=*/0, /*Annot=*/"", *STI, MulsDOS);
  MulsDOS.flush();
  EXPECT_EQ(Printed, "\tmuls.d\tr2, r3, r4");

  Printed.clear();
  raw_string_ostream MuluDOS(Printed);
  InstPrinter->printInst(&MuluD, /*Address=*/0, /*Annot=*/"", *STI, MuluDOS);
  MuluDOS.flush();
  EXPECT_EQ(Printed, "\tmulu.d\tr2, r3, r4");

  Printed.clear();
  raw_string_ostream MusfrOS(Printed);
  InstPrinter->printInst(&Musfr, /*Address=*/0, /*Annot=*/"", *STI, MusfrOS);
  MusfrOS.flush();
  EXPECT_EQ(Printed, "\tmusfr\tr1");

  Printed.clear();
  raw_string_ostream OrOS(Printed);
  InstPrinter->printInst(&Or, /*Address=*/0, /*Annot=*/"", *STI, OrOS);
  OrOS.flush();
  EXPECT_EQ(Printed, "\tor\tr1, r2");

  Printed.clear();
  raw_string_ostream PushjcOS(Printed);
  InstPrinter->printInst(&Pushjc, /*Address=*/0, /*Annot=*/"", *STI,
                         PushjcOS);
  PushjcOS.flush();
  EXPECT_EQ(Printed, "\tpushjc");

  Printed.clear();
  raw_string_ostream RetdOS(Printed);
  InstPrinter->printInst(&Retd, /*Address=*/0, /*Annot=*/"", *STI, RetdOS);
  RetdOS.flush();
  EXPECT_EQ(Printed, "\tretd");

  Printed.clear();
  raw_string_ostream ReteOS(Printed);
  InstPrinter->printInst(&Rete, /*Address=*/0, /*Annot=*/"", *STI, ReteOS);
  ReteOS.flush();
  EXPECT_EQ(Printed, "\trete");

  Printed.clear();
  raw_string_ostream RetalOS(Printed);
  InstPrinter->printInst(&Retal, /*Address=*/0, /*Annot=*/"", *STI, RetalOS);
  RetalOS.flush();
  EXPECT_EQ(Printed, "\tretal\tlr");

