cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Printed.clear();
  raw_string_ostream RetccOS(Printed);
  InstPrinter->printInst(&Retcc, /*Address=*/0, /*Annot=*/"", *STI, RetccOS);
  RetccOS.flush();
  EXPECT_EQ(Printed, "\tretcc\tlr");

  Printed.clear();
  raw_string_ostream RetcsOS(Printed);
  InstPrinter->printInst(&Retcs, /*Address=*/0, /*Annot=*/"", *STI, RetcsOS);
  RetcsOS.flush();
  EXPECT_EQ(Printed, "\tretcs\tlr");

  Printed.clear();
  raw_string_ostream RetloOS(Printed);
  InstPrinter->printInst(&Retlo, /*Address=*/0, /*Annot=*/"", *STI, RetloOS);
  RetloOS.flush();
  EXPECT_EQ(Printed, "\tretlo\tlr");

  Printed.clear();
  raw_string_ostream RetgeOS(Printed);
  InstPrinter->printInst(&Retge, /*Address=*/0, /*Annot=*/"", *STI, RetgeOS);
  RetgeOS.flush();
  EXPECT_EQ(Printed, "\tretge\tlr");

  Printed.clear();
  raw_string_ostream RethsOS(Printed);
  InstPrinter->printInst(&Reths, /*Address=*/0, /*Annot=*/"", *STI, RethsOS);
  RethsOS.flush();
  EXPECT_EQ(Printed, "\treths\tlr");

  Printed.clear();
  raw_string_ostream ReteqOS(Printed);
  InstPrinter->printInst(&Reteq, /*Address=*/0, /*Annot=*/"", *STI, ReteqOS);
  ReteqOS.flush();
  EXPECT_EQ(Printed, "\treteq\tlr");

  Printed.clear();
  raw_string_ostream RetneOS(Printed);
  InstPrinter->printInst(&Retne, /*Address=*/0, /*Annot=*/"", *STI, RetneOS);
  RetneOS.flush();
  EXPECT_EQ(Printed, "\tretne\tlr");

  Printed.clear();
  raw_string_ostream RetjOS(Printed);
  InstPrinter->printInst(&Retj, /*Address=*/0, /*Annot=*/"", *STI, RetjOS);
  RetjOS.flush();
  EXPECT_EQ(Printed, "\tretj");

  Printed.clear();
  raw_string_ostream RetsOS(Printed);
  InstPrinter->printInst(&Rets, /*Address=*/0, /*Annot=*/"", *STI, RetsOS);
  RetsOS.flush();
  EXPECT_EQ(Printed, "\trets");

  Printed.clear();
  raw_string_ostream RetssOS(Printed);
  InstPrinter->printInst(&Retss, /*Address=*/0, /*Annot=*/"", *STI, RetssOS);
  RetssOS.flush();
  EXPECT_EQ(Printed, "\tretss");

  Printed.clear();
  raw_string_ostream RolOS(Printed);
  InstPrinter->printInst(&Rol, /*Address=*/0, /*Annot=*/"", *STI, RolOS);
  RolOS.flush();
  EXPECT_EQ(Printed, "\trol\tr1");

  Printed.clear();
  raw_string_ostream RorOS(Printed);
  InstPrinter->printInst(&Ror, /*Address=*/0, /*Annot=*/"", *STI, RorOS);
  RorOS.flush();
  EXPECT_EQ(Printed, "\tror\tr1");

  Printed.clear();
  raw_string_ostream RsubOS(Printed);
  InstPrinter->printInst(&Rsub, /*Address=*/0, /*Annot=*/"", *STI, RsubOS);
  RsubOS.flush();
  EXPECT_EQ(Printed, "\trsub\tr1, r2");

  Printed.clear();
  raw_string_ostream SbcOS(Printed);
  InstPrinter->printInst(&Sbc, /*Address=*/0, /*Annot=*/"", *STI, SbcOS);
  SbcOS.flush();
  EXPECT_EQ(Printed, "\tsbc\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream ScallOS(Printed);
  InstPrinter->printInst(&Scall, /*Address=*/0, /*Annot=*/"", *STI, ScallOS);
  ScallOS.flush();
  EXPECT_EQ(Printed, "\tscall");

  Printed.clear();
  raw_string_ostream ScrOS(Printed);
  InstPrinter->printInst(&Scr, /*Address=*/0, /*Annot=*/"", *STI, ScrOS);
  ScrOS.flush();
  EXPECT_EQ(Printed, "\tscr\tr1");

  Printed.clear();
  raw_string_ostream SleepOS(Printed);
  InstPrinter->printInst(&Sleep, /*Address=*/0, /*Annot=*/"", *STI, SleepOS);
  SleepOS.flush();
  EXPECT_EQ(Printed, "\tsleep\t1");

  Printed.clear();
  raw_string_ostream SsrfOS(Printed);
  InstPrinter->printInst(&Ssrf, /*Address=*/0, /*Annot=*/"", *STI, SsrfOS);
  SsrfOS.flush();
  EXPECT_EQ(Printed, "\tssrf\t1");

  Printed.clear();
  raw_string_ostream SubOS(Printed);
  InstPrinter->printInst(&Sub, /*Address=*/0, /*Annot=*/"", *STI, SubOS);
  SubOS.flush();
  EXPECT_EQ(Printed, "\tsub\tr1, r2");

  Printed.clear();
  raw_string_ostream SwapBHOS(Printed);
  InstPrinter->printInst(&SwapBH, /*Address=*/0, /*Annot=*/"", *STI, SwapBHOS);
  SwapBHOS.flush();
  EXPECT_EQ(Printed, "\tswap.bh\tr1");

  Printed.clear();
  raw_string_ostream SwapBOS(Printed);
  InstPrinter->printInst(&SwapB, /*Address=*/0, /*Annot=*/"", *STI, SwapBOS);
  SwapBOS.flush();
  EXPECT_EQ(Printed, "\tswap.b\tr1");

  Printed.clear();
  raw_string_ostream SwapHOS(Printed);
  InstPrinter->printInst(&SwapH, /*Address=*/0, /*Annot=*/"", *STI, SwapHOS);
  SwapHOS.flush();
  EXPECT_EQ(Printed, "\tswap.h\tr1");

  Printed.clear();
  raw_string_ostream SyncOS(Printed);
  InstPrinter->printInst(&Sync, /*Address=*/0, /*Annot=*/"", *STI, SyncOS);
  SyncOS.flush();
  EXPECT_EQ(Printed, "\tsync\t1");

  Printed.clear();
  raw_string_ostream TlbrOS(Printed);
  InstPrinter->printInst(&Tlbr, /*Address=*/0, /*Annot=*/"", *STI, TlbrOS);
  TlbrOS.flush();
  EXPECT_EQ(Printed, "\ttlbr");

  Printed.clear();
  raw_string_ostream TlbsOS(Printed);
  InstPrinter->printInst(&Tlbs, /*Address=*/0, /*Annot=*/"", *STI, TlbsOS);
  TlbsOS.flush();
  EXPECT_EQ(Printed, "\ttlbs");

  Printed.clear();
  raw_string_ostream TlbwOS(Printed);
  InstPrinter->printInst(&Tlbw, /*Address=*/0, /*Annot=*/"", *STI, TlbwOS);
  TlbwOS.flush();
  EXPECT_EQ(Printed, "\ttlbw");

  Printed.clear();
  raw_string_ostream TstOS(Printed);
  InstPrinter->printInst(&Tst, /*Address=*/0, /*Annot=*/"", *STI, TstOS);
  TstOS.flush();
  EXPECT_EQ(Printed, "\ttst\tr1, r2");

  Printed.clear();
  raw_string_ostream MovOS(Printed);
  InstPrinter->printInst(&Mov, /*Address=*/0, /*Annot=*/"", *STI, MovOS);
  MovOS.flush();
  EXPECT_EQ(Printed, "\tmov\tr1, r2");

  Printed.clear();
  raw_string_ostream MovImmOS(Printed);
  InstPrinter->printInst(&MovImm, /*Address=*/0, /*Annot=*/"", *STI, MovImmOS);
  MovImmOS.flush();
  EXPECT_EQ(Printed, "\tmov\tr1, -1");

  SourceMgr SrcMgr;
  SrcMgr.AddNewSourceBuffer(
      MemoryBuffer::getMemBuffer(
          "nop\nfrs\nabs r1\nacr r1\nadc r1, r2, r3\naddabs r1, r2, r3\nadd r1, r2\nand r1, r2\nandn r1, r2\nasr r1, r2, r3\nbrev r1\nbreakpoint\ncasts.b r1\ncasts.h r1\ncastu.b r1\ncastu.h r1\ncom r1\ncpc r1\ncpc r1, r2\ncp.w r1, r2\ncp.w r1, -1\ncp.w r1, 32\ncsrf 1\nneg r1\neor r1, r2\nicall r1\nlsl r1, r2, r3\nlsr r1, r2, r3\nmax r1, r2, r3\nmin r1, r2, r3\nmul r1, r2\nmul r1, r2, -1\nmul r1, r2, r3\nmuls.d r2, r3, r4\nmulu.d r2, r3, r4\nmusfr r1\nor r1, r2\npushjc\nretd\nrete\nretal lr\nretcc lr\nretcs lr\nretlo lr\nretge lr\nreths lr\nreteq lr\nretne lr\nretj\nrets\nretss\nrol r1\nror r1\nrsub r1, r2\nsbc r1, r2, r3\nscall\nscr r1\nsleep 1\nssrf 1\nsub r1, r2\nswap.bh r1\nswap.b r1\nswap.h r1\nsync 1\ntlbr\ntlbs\ntlbw\ntst r1, r2\nmov r1, r2\nmov r1, -1\n"),
      SMLoc());

  MCContext ParseCtx(TT, *MAI, *MRI, *STI, &SrcMgr);
  std::unique_ptr<MCObjectFileInfo> MOFI(
      TheTarget->createMCObjectFileInfo(ParseCtx, /*PIC=*/false));
  ParseCtx.setObjectFileInfo(MOFI.get());

  std::unique_ptr<MCStreamer> Streamer(
      TheTarget->createNullStreamer(ParseCtx));
  std::unique_ptr<MCAsmParser> Parser(
      createMCAsmParser(SrcMgr, ParseCtx, *Streamer, *MAI));
  std::unique_ptr<MCTargetAsmParser> TargetParser(
      TheTarget->createMCAsmParser(*STI, *Parser, *MII));
  ASSERT_NE(TargetParser.get(), nullptr);
  Parser->setTargetParser(*TargetParser);
  EXPECT_FALSE(Parser->Run(/*NoInitialTextSection=*/false));
}

} // namespace
